# wishlist = wl
texts = {
    "greet": "Привет <b>{username}</b>!\n"
             "Я бот-вишлист, помогу тебе составить список из "
             "твоих желаний и найти друзей, <b>Вишлисты</b> "
             "которых ты хочешь посмотреть!\n\nВыбирай ниже!",

    "price_error": "Цена должна быть только <u>числом</u>! "
                   "Введите данные еще раз",

    "view_wl": "Вот ваш Вишлист!\n\nНазвание | Цена\n{}\n{}",

    "view_friend_wl": "Вот Вишлист друга!\n\nНазвание | Цена\n{}\n{}",

    "delete_from_wl": "Выберите <u>номер</u> <b>желания</b>, которое вы хотите удалить",

    "create_wl": "Похоже, у вас еще нет <b>Вишлиста.</b>\n\n<b><u>Давайте его создадим!</u></b>",

    "menu": "В <b><u>Вишлист</u></b> вы можете создать и/или добавить "
            "какое либо <b>желание</b> в список\n\n"
            "В <b><u>Друзья</u></b> вы можете отправлять запросы "
            "и принимать их, чтобы добавлять других людей в друзья.\n"
            "<b><u>Друзья</u></b> могут просматривать <b><u>Вишлист</u></b> друг у друга!",

    "wl": "<b><u>Вишлист</u></b>\n\n⬇️Выберите действие ниже⬇️",

    "friends": "<b><u>Друзья</u></b>\n\n⬇️Выберите действие ниже⬇️",

    "add_name_wl": "Напишите название желания✍️ :",

    "add_price": "Отлично!✅\nТеперь укажите цену в рублях: ",

    "add_description": "Nice!😊\nЕсли хотите, добавьте описание: ",

    "add_photo": "Хорошо!\nПришлите фото📷 своего желания",

    "add_link": "И последнее!\nЕсли на желание есть ссылка, пришли её: ",

    "confirm_add": "Отлично!✅\nДобавляем?",

    "add_friend": "Пришли контакт человека, "
                  "которому хочешь отправить запрос в друзья",

    "processing_request": "Отправьте номер заявки, которую "
                          "хотите {}: ",

    "delete_friend": "Отправьте номер друга, которого "
                     "хотите удалить: ",

    "check_req_list": "{}\n\nИмя | id\n{}\n{}",

    "check_item_wl_reply": "Выберите номер <b>желания</b>, которое хотите рассмотреть подробней: ",

    "check_item_wl": "<b>Название</b>: {}\n<b>Цена</b>: {}\n\n<b>Описание</b>: {}"

}
